_posts/temp/rajesh.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Presenting the narrative</a></li>
<li><a href="#sec-2">2. Rough</a></li>
<li><a href="#sec-3">3. Jump options:</a></li>
<li><a href="#sec-4">4. What I want and What I am currently not!</a></li>
<li><a href="#sec-5">5. Questions to rajesh</a></li>
<li><a href="#sec-6">6. Friends?</a></li>
<li><a href="#sec-7">7. jump</a></li>
</ul>
</div>
</div>

# Presenting the narrative<a id="sec-1" name="sec-1"></a>

-   I am in my prime&#x2026;

-   Goal is to  gain flexible and crazy career capital

# Rough<a id="sec-2" name="sec-2"></a>

how to come to the us? shoudl I come to the US

I think i can do more.

gaining career capital, not sure if where i am working is the place for this?

My simple idea
1.  jump within netherlands gain ex and then move to other countries where I can kill!

2.  do MIS / another masters

3.  GMAT

# Jump options:<a id="sec-3" name="sec-3"></a>

1.  Management consultant at the big3 Mckensy, with GMAT/Management masters
2.  Investment banking
3.  DATA scientist after doing some bootcamp courses or just join a traineeship
4.  SALes
5.  Marketting
6.  Join asml and find my way through different groups!

5b. Jump with Holland to a starting job or a traineeship and see where that takes you, atleast you will gain career capital

Making the jump to sales?

# What I want and What I am currently not!<a id="sec-4" name="sec-4"></a>

+# Begin<sub>Quote</sub>

Some of the best ways to gain career capital early on include:

Working in any organisation which has, or with any people who have, a
reputation for high performance e.g. top consultancy or technology
firms, or any work with a great mentor or team.  Undertaking certain
graduate studies, especially applied quantitative subjects like
economics, computer science and applied mathematics.  Anything that
gives you a valuable transferable skill e.g. programming, data
science, marketing.  Taking opportunities which allow you to achieve
impressive and socially valuable things e.g. founding an organisation,
doing anything at which you might excel.

+# End<sub>Quote</sub>

# Questions to rajesh<a id="sec-5" name="sec-5"></a>

How did you jump to sales? after a shop floor scene!

stay technical! enhance your skills! management as an opotion investment banking

Part time MBA?

Minimum work 4-5 years needed" according to rajesh

Sales do not do!

Marketting product managenment &#x2013;> more money, start technicla, start company&#x2026; give you skiulls similar to sales!

Look at end and come back! not bored of engineering, good with people ! flexible 

cannot Have  a broad direction! find pasasion! knwo somesort of probelm!

Rate your career options!

You cannot get rid of your back groynd???????!!!!!!!

Yes!  give some intervies!

scholorship no  in the US! Check with people ! INCARD working professionals! check NC do part time from a good cvollege!b

how many years! ISB&#x2013;> GMAT 24 lakhs! &#x2013;> part time! part sponsorship ! check on the ability to learn forever!

You need to knwo what you want to do!

Do you or not take your parents money ! Look at loansw possibility here!

Merges and aquisitions! Unless you have value to offer! Investment banking&#x2026; mostly do research!

you will know businews of an industry !

jump in a sinlgle year&#x2026; 

Working in a msall company not doing much why!!! atleast earn a lo t of monye and get more options!
ASML! Philips!

DS! area going to be in very high demand!

Amazon, goolge, Europe! take an inter company transfer!

India,&#x2026;. to US and got greenb card! lot of people ahve done it&#x2026;. intoor! 1 year green card!

Work for a big company! Find aoppor to go to US&#x2026; Do part time MBA!

DS! get deeper! personal fit! start thinking! all  options sem to fit&#x2026; get into something  personal fit!

# Friends?<a id="sec-6" name="sec-6"></a>

# jump<a id="sec-7" name="sec-7"></a>

I moved out of engineering!

ability to convince people that you will move to sales!
